---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.CircuitNamingScheme
source: html/4a7099cd-2aa5-affd-108a-68ccd0124bda.htm
---
# CircuitNamingScheme Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.